<a href="https://colab.research.google.com/github/robsonbfreitas/ColetaDeDados/blob/main/ColetaDadosComAPI.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [22]:
import json, requests
import pandas as pd
resp = requests.get('http://api.bcb.gov.br/dados/serie/bcdata.sgs.10844/dados?formato=json')
print (resp.status_code)

200

In [24]:
ipca = ''

In [25]:
ipca = json.loads(resp.text)

In [ ]:
ipca

In [30]:
df = pd.DataFrame.from_dict(ipca)

In [31]:
df

           data  valor
0    01/01/1992  25.84
1    01/02/1992  22.17
2    01/03/1992  20.74
3    01/04/1992  20.14
4    01/05/1992  26.93
..          ...    ...
344  01/09/2020   0.17
345  01/10/2020   0.55
346  01/11/2020   0.39
347  01/12/2020   0.83
348  01/01/2021   0.07

[349 rows x 2 columns]